# Brewfile — macOS package manifest
# Usage: brew bundle
# Install everything: brew bundle --file=Brewfile

tap "homebrew/bundle"

# ── Dotfile manager ───────────────────────────────────────────────────────────
brew "chezmoi"

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "direnv"
brew "zoxide"
brew "fzf"

# ── Version manager ───────────────────────────────────────────────────────────
brew "mise"

# ── Modern CLI replacements ───────────────────────────────────────────────────
brew "eza"           # ls replacement
brew "bat"           # cat replacement
brew "fd"            # find replacement
brew "ripgrep"       # grep replacement
brew "the_silver_searcher"  # ag

# ── Data tools ────────────────────────────────────────────────────────────────
brew "jq"
brew "yq"

# ── Editor ────────────────────────────────────────────────────────────────────
brew "neovim"

# ── Git & GitHub ──────────────────────────────────────────────────────────────
brew "git"
brew "gh"
brew "git-delta"     # better diffs

# ── GPG ───────────────────────────────────────────────────────────────────────
brew "gnupg"
brew "pinentry-mac"

# ── Networking / utilities ────────────────────────────────────────────────────
brew "curl"
brew "wget"
brew "httpie"
brew "tldr"
brew "tree"
brew "watch"

# ── Terminal emulator ─────────────────────────────────────────────────────────
cask "alacritty"

# ── Multiplexer ───────────────────────────────────────────────────────────────
brew "zellij"

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"
